; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v7 - type_1 ?v4 - type_2)
 	      (pred_1 ?v1 - object ?v4 - type_2)
	      (pred_2 ?v7 - type_1 ?v8 - type_3)
	      (pred_4 ?v7 - type_1 ?v1 - object ?v8 - type_3))

   (:action op_2
       :parameters  (?v7 - type_1 ?v2 ?v6 - type_2)
       :precondition (and  (pred_3 ?v7 ?v2))
       :effect (and  (pred_3 ?v7 ?v6)
		     (not (pred_3 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_1 ?v5 - object ?v3 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v3) (pred_3 ?v7 ?v3) (pred_2 ?v7 ?v8))
       :effect (and (pred_4 ?v7 ?v5 ?v8)
		    (not (pred_1 ?v5 ?v3)) 
		    (not (pred_2 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_1 ?v5 - object ?v3 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v5 ?v8) (pred_3 ?v7 ?v3))
       :effect (and (pred_1 ?v5 ?v3)
		    (pred_2 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v5 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_02 - type_1
obj_08 obj_12 obj_09 obj_04 - type_3
obj_11 obj_05 obj_06 - type_2
obj_07 obj_03 obj_01 - object)
(:init
(pred_3 obj_10 obj_06)
(pred_2 obj_10 obj_08)
(pred_2 obj_10 obj_12)
(pred_3 obj_02 obj_11)
(pred_2 obj_02 obj_09)
(pred_2 obj_02 obj_04)
(pred_1 obj_07 obj_11)
(pred_1 obj_03 obj_06)
(pred_1 obj_01 obj_11)
)
(:goal
(and
(pred_1 obj_07 obj_06)
(pred_1 obj_03 obj_11)
(pred_1 obj_01 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_10 obj_06) (pred_3 obj_02 obj_06))))
  )
)
)

; plan
1. (op_1 obj_02 obj_01 obj_11 obj_04)
   deleted: (pred_1 obj_01 obj_11) (pred_2 obj_02 obj_04)
   added: (pred_4 obj_02 obj_01 obj_04)
   goals met: 0 of 3
2. (op_1 obj_02 obj_07 obj_11 obj_09)
   deleted: (pred_1 obj_07 obj_11) (pred_2 obj_02 obj_09)
   added: (pred_4 obj_02 obj_07 obj_09)
   goals met: 0 of 3
3. (op_1 obj_10 obj_03 obj_06 obj_12)
   deleted: (pred_1 obj_03 obj_06) (pred_2 obj_10 obj_12)
   added: (pred_4 obj_10 obj_03 obj_12)
   goals met: 0 of 3
4. (op_2 obj_10 obj_06 obj_11)
   deleted: (pred_3 obj_10 obj_06)
   added: (pred_3 obj_10 obj_11)
   goals met: 0 of 3
5. (op_2 obj_02 obj_11 obj_06)
   deleted: (pred_3 obj_02 obj_11)
   added: (pred_3 obj_02 obj_06)
   goals met: 0 of 3
6. (op_3 obj_02 obj_01 obj_06 obj_04)
   deleted: (pred_4 obj_02 obj_01 obj_04)
   added: (pred_1 obj_01 obj_06) (pred_2 obj_02 obj_04)
   goals met: 1 of 3
7. (op_3 obj_02 obj_07 obj_06 obj_09)
   deleted: (pred_4 obj_02 obj_07 obj_09)
   added: (pred_1 obj_07 obj_06) (pred_2 obj_02 obj_09)
   goals met: 2 of 3
8. (op_3 obj_10 obj_03 obj_11 obj_12)
   deleted: (pred_4 obj_10 obj_03 obj_12)
   added: (pred_1 obj_03 obj_11) (pred_2 obj_10 obj_12)
   goals met: 3 of 3
